---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.FabricSheetType
source: html/b9f5859d-2d74-15f5-8111-eaace1e43815.htm
---
# FabricSheetType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.